In [1]:
import numpy as np
import pandas as pd

In [2]:
label =['a','b','c','d']
list1 =[10,20,30,40]
arr =np.arange(4)
d ={
    1:10,
    2:20,
    3:30,
    4:40
}

In [3]:
pd.Series(list1,index=label)

a    10
b    20
c    30
d    40
dtype: int64

In [4]:
pd.Series(d)

1    10
2    20
3    30
4    40
dtype: int64

In [5]:
employees = {
    "name":   ["Amit", "Priya", "Rahul", "Sneha", "Vikas", "Neha", "Arjun", "Meera", "Rohit", "Anita"],
    "age":    [25, 28, 32, 29, 35, 27, 31, 26, 30, 33],
    "salary": [30000, 45000, 50000, 40000, 55000, 38000, 60000, 35000, 47000, 52000],
    "city":   ["Mumbai", "Delhi", "Bangalore", "Pune", "Chennai", "Hyderabad", "Kolkata", "Jaipur", "Lucknow", "Ahmedabad"]
}

In [6]:
df= pd.DataFrame(employees)
df.head()

    name  age  salary       city
0   Amit   25   30000     Mumbai
1  Priya   28   45000      Delhi
2  Rahul   32   50000  Bangalore
3  Sneha   29   40000       Pune
4  Vikas   35   55000    Chennai

In [7]:
emp_list =[
    ["john",45,"ny",444],
    ['robert',73,'wa',855],
    ['peter',45,'oh',499],
    ['mark',56,'nm',599]
]

In [8]:
pd.DataFrame(emp_list)

        0   1   2    3
0    john  45  ny  444
1  robert  73  wa  855
2   peter  45  oh  499
3    mark  56  nm  599

In [9]:
col = ["name","age","city","salary"]

In [10]:
emp = pd.DataFrame(emp_list,columns=col)
emp

     name  age city  salary
0    john   45   ny     444
1  robert   73   wa     855
2   peter   45   oh     499
3    mark   56   nm     599

Numpy exercise

In [11]:
sal = np.array(df)
sal

array([['Amit', 25, 30000, 'Mumbai'],
       ['Priya', 28, 45000, 'Delhi'],
       ['Rahul', 32, 50000, 'Bangalore'],
       ['Sneha', 29, 40000, 'Pune'],
       ['Vikas', 35, 55000, 'Chennai'],
       ['Neha', 27, 38000, 'Hyderabad'],
       ['Arjun', 31, 60000, 'Kolkata'],
       ['Meera', 26, 35000, 'Jaipur'],
       ['Rohit', 30, 47000, 'Lucknow'],
       ['Anita', 33, 52000, 'Ahmedabad']], dtype=object)

In [12]:
max = np.max(sal[:,2].astype(int))
age = np.min(sal[:,1])
mean = np.mean(sal[:,2])

print(max,age,mean,end=" ")

60000 25 45200.0

In [13]:
wh = np.where((sal[:,2]>50000) & (sal[:,1]>25 ))
sal[wh]

array([['Vikas', 35, 55000, 'Chennai'],
       ['Arjun', 31, 60000, 'Kolkata'],
       ['Anita', 33, 52000, 'Ahmedabad']], dtype=object)

selection and indexing of column

In [14]:
df[['city','name']].head()

        city   name
0     Mumbai   Amit
1      Delhi  Priya
2  Bangalore  Rahul
3       Pune  Sneha
4    Chennai  Vikas

creating new column

In [15]:

df['designations'] = [
    "Project Manager",
    "Technical Lead",
    "Senior Software Engineer",
    "UX/UI Designer",
    "Quality Assurance Analyst",
    "Business Analyst",
    "Content Strategist",
    "DevOps Engineer",
    "Marketing Coordinator",
    "Customer Success Manager"
]

In [16]:
df.head()

    name  age  salary       city               designations
0   Amit   25   30000     Mumbai            Project Manager
1  Priya   28   45000      Delhi             Technical Lead
2  Rahul   32   50000  Bangalore   Senior Software Engineer
3  Sneha   29   40000       Pune             UX/UI Designer
4  Vikas   35   55000    Chennai  Quality Assurance Analyst

drop the column

In [17]:
df.drop('designations',axis=1)  # for single column

    name  age  salary       city
0   Amit   25   30000     Mumbai
1  Priya   28   45000      Delhi
2  Rahul   32   50000  Bangalore
3  Sneha   29   40000       Pune
4  Vikas   35   55000    Chennai
5   Neha   27   38000  Hyderabad
6  Arjun   31   60000    Kolkata
7  Meera   26   35000     Jaipur
8  Rohit   30   47000    Lucknow
9  Anita   33   52000  Ahmedabad

In [18]:
# df.drop(['designations','city','name'],axis=1)# for mulitple column

In [19]:
# inplace  true city and designations

df.drop('designations',axis=1,inplace=True)

In [20]:
df

    name  age  salary       city
0   Amit   25   30000     Mumbai
1  Priya   28   45000      Delhi
2  Rahul   32   50000  Bangalore
3  Sneha   29   40000       Pune
4  Vikas   35   55000    Chennai
5   Neha   27   38000  Hyderabad
6  Arjun   31   60000    Kolkata
7  Meera   26   35000     Jaipur
8  Rohit   30   47000    Lucknow
9  Anita   33   52000  Ahmedabad

drop row using drop ,inplace true and axis =0

In [21]:
df.drop(9,axis=0)

    name  age  salary       city
0   Amit   25   30000     Mumbai
1  Priya   28   45000      Delhi
2  Rahul   32   50000  Bangalore
3  Sneha   29   40000       Pune
4  Vikas   35   55000    Chennai
5   Neha   27   38000  Hyderabad
6  Arjun   31   60000    Kolkata
7  Meera   26   35000     Jaipur
8  Rohit   30   47000    Lucknow

selecting a row

In [22]:
df.loc[[1,2]]

    name  age  salary       city
1  Priya   28   45000      Delhi
2  Rahul   32   50000  Bangalore

In [23]:
df.iloc[[1]]

    name  age  salary   city
1  Priya   28   45000  Delhi

In [24]:
df.loc[[5,8,9],['salary','age']]

   salary  age
5   38000   27
8   47000   30
9   52000   33

In [25]:
df.loc[[2,3],['name','age']]

    name  age
2  Rahul   32
3  Sneha   29

conditional selection age greather than 30

In [26]:
df[df['age']>30]

    name  age  salary       city
2  Rahul   32   50000  Bangalore
4  Vikas   35   55000    Chennai
6  Arjun   31   60000    Kolkata
9  Anita   33   52000  Ahmedabad

In [27]:
df[(df['age']>30) & (df['city'] =='Chennai')]

    name  age  salary     city
4  Vikas   35   55000  Chennai

In [28]:
df[(df['age']<28)& (df['salary']>25000)]

    name  age  salary       city
0   Amit   25   30000     Mumbai
5   Neha   27   38000  Hyderabad
7  Meera   26   35000     Jaipur

In [36]:
df[(df['age']<30) & (df['salary']>30000)]

    name  age  salary       city
1  Priya   28   45000      Delhi
3  Sneha   29   40000       Pune
5   Neha   27   38000  Hyderabad
7  Meera   26   35000     Jaipur